УТ_для_edt/src/InformationRegisters/CRM_НепрочитанныеЭлектронныеПисьма/CRM_НепрочитанныеЭлектронныеПисьма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_НепрочитанныеЭлектронныеПисьма</name>
  <dimensions>
    <name>УдалитьУчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПапка</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/CRM_ОтложенныеОперацииПоIMAP/CRM_ОтложенныеОперацииПоIMAP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ОтложенныеОперацииПоIMAP</name>
  <attributes>
    <name>ИмяПапкиНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ПапкиЭлектронныхПисем</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>EnumRef.CRM_ДействияПоIMAP</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/CRM_ДействияПоIMAP/CRM_ДействияПоIMAP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ДействияПоIMAP</name>
  <enumValues>
    <name>ПереместитьВсеПисьмаВПапку</name>
  </enumValues>
  <enumValues>
    <name>ПереместитьПисьмоВПапку</name>
  </enumValues>
  <enumValues>
    <name>СнятьФлагПрочтения</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПапку</name>
  </enumValues>
  <enumValues>
    <name>УстановитьФлагПрочтения</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/InformationRegisters/CRM_НепрочитанныеЭлектронныеПисьма/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отбор.Письмо.Значение.УчетнаяЗапись.CRM_СинхронизироватьПапкиСПочтовымСервером Тогда
		Прочитано = (Количество() = 0);
		ЗаписьДействия = РегистрыСведений.CRM_ОтложенныеОперацииПоIMAP.СоздатьМенеджерЗаписи();
		ЗаписьДействия.Объект = Отбор.Письмо.Значение;
		ЗаписьДействия.УчетнаяЗапись = Отбор.Письмо.Значение.УчетнаяЗапись;
		ЗаписьДействия.Действие = ?(НЕ Прочитано, Перечисления.CRM_ДействияПоIMAP.УстановитьФлагПрочтения, Перечисления.CRM_ДействияПоIMAP.СнятьФлагПрочтения);
		ЗаписьДействия.Прочитать();
		Если ЗаписьДействия.Выбран() Тогда
			ЗаписьДействия.Удалить();
		КонецЕсли;
		ЗаписьДействия = РегистрыСведений.CRM_ОтложенныеОперацииПоIMAP.СоздатьМенеджерЗаписи();
		ЗаписьДействия.Объект = Отбор.Письмо.Значение;
		ЗаписьДействия.УчетнаяЗапись = Отбор.Письмо.Значение.УчетнаяЗапись;
		ЗаписьДействия.Действие = ?(Прочитано, Перечисления.CRM_ДействияПоIMAP.УстановитьФлагПрочтения, Перечисления.CRM_ДействияПоIMAP.СнятьФлагПрочтения);
		ЗаписьДействия.ИмяПапкиНаСервере = "";
		ЗаписьДействия.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
